In [1]:
import numpy as np
import pandas as pd

In [ ]:
# Pandas <- numpy

# python으로 하는 excel
# datatype
# 1. series <- numpy 1차원 vector
# 2. DataFrame <- series 여러개가 column으로 이어서 만들어진 matrix <- numpy matrix

### series
#### numpy array vector * index가 없다
#### series <- numpy array vector + index
#### pd.Series()

In [3]:
L = [1,2,3,4]
pd.Series(L)

0    1
1    2
2    3
3    4
dtype: int64

In [21]:
L = [1,2,3,4]
s = pd.Series(L, index = ["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [22]:
s["c"]=10

In [23]:
s [["c","d"]]

c    10
d     4
dtype: int64

In [24]:
s > 5 # broadcasting

a    False
b    False
c     True
d    False
dtype: bool

In [25]:
s[s > 5]       # boolean indexing

c    10
dtype: int64

In [26]:
'a' in s

True

In [27]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [28]:
s.values

array([ 1,  2, 10,  4], dtype=int64)

In [29]:
s.index = ["가","나","다","라"]
s

가     1
나     2
다    10
라     4
dtype: int64

### DataFrame
#### series가 column 단위로 붙어서 만들어진 matrix (series -> dataframe)
#### pd.DataFrame()

In [12]:
raw_data = {'first_name' : ['jason', np.nan, 'tina', 'jake', 'amy'], 
            'last_name': ['miller', np.nan, 'ali','milner', 'coozer'],
            'age' : [42, np.nan, 36, 24, 73],
            'pretestscore' : [4, np.nan, np.nan, 2, 4],
            'postestscore' : [25, np.nan, np.nan, 62, 72]}
raw_data

{'first_name': ['jason', nan, 'tina', 'jake', 'amy'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 36, 24, 73],
 'pretestscore': [4, nan, nan, 2, 4],
 'postestscore': [25, nan, nan, 62, 72]}

In [13]:
df = pd.DataFrame(raw_data)
df

  first_name last_name   age  pretestscore  postestscore
0      jason    miller  42.0           4.0          25.0
1        NaN       NaN   NaN           NaN           NaN
2       tina       ali  36.0           NaN           NaN
3       jake    milner  24.0           2.0          62.0
4        amy    coozer  73.0           4.0          72.0

In [16]:
# 데이터를 가공할 때 일반적 보편적 처리 방식..
# column - 특징을 칼럼으로 잡는다. ex) 학생 학년, 이름, 주소, 설정..
# row - 개별 데이터 값 예 - 첫번째 학생, 두번째 학생

# column - feature, 열 
# row - data, 행

In [17]:
# 하나의 칼럼 - 하나의 series < np.array < 원소가 동일한 데이터타입으로 구성
# dataframe - series가 연결된 matrix

# 하나의 칼럼에는 동일한 타입의 데이터로 구성된다
# 칼럼 간에는 다른 데이터타입의 칼럼들이 존재한다

In [ ]:
# column indexing -> df [col_name]

In [18]:
df["first_name"]

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [20]:
df[["last_name","age"]]

  last_name   age
0    miller  42.0
1       NaN   NaN
2       ali  36.0
3    milner  24.0
4    coozer  73.0

In [ ]:
df.first_name

# 속성으로 칼럼을 접근하는 방식..
1. 칼럼 이름에 space가 있으면 안 됨.
2. 칼럼을 수정할 때 주의가 필요

In [ ]:
# df['age'] = df['age'].apply

In [ ]:
# row indexing

# df.loc[index name]
# df.iloc[index order num]

# loc[], iloc[] - row와 column을 동시에 선택할 수도 있다.

In [31]:
df.index = ["a","b","c","d","e"]
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [ ]:
df.loc['d']       # index 이름

In [32]:
df.iloc[3]       # 품번

first_name        jake
last_name       milner
age               24.0
pretestscore       2.0
postestscore      62.0
Name: d, dtype: object

In [33]:
df.iloc[3:]

  first_name last_name   age  pretestscore  postestscore
d       jake    milner  24.0           2.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [35]:
df.iloc[[2,4]]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [38]:
df.loc['c','last_name']

'ali'

In [36]:
df.loc[['c','d']]

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0           2.0          62.0

In [41]:
df.loc[['c','d'],"first_name" : 'age']

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [43]:
df. iloc[[2,3], :3]

  first_name last_name   age
c       tina       ali  36.0
d       jake    milner  24.0

In [44]:
df.loc['d','pretestscore'] = 100.0
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [45]:
df.iloc[[2,4],[2,4]]

    age  postestscore
c  36.0           NaN
e  73.0          72.0

In [46]:
df[::2]

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
c       tina       ali  36.0           NaN           NaN
e        amy    coozer  73.0           4.0          72.0

In [47]:
df.iloc[1:5:2, :]

  first_name last_name   age  pretestscore  postestscore
b        NaN       NaN   NaN           NaN           NaN
d       jake    milner  24.0         100.0          62.0

In [ ]:
# loc [row name, col name], iloc[row index, col index]
# row와 column을 동시에 선택할 수도 있다.

In [48]:
df

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
b        NaN       NaN   NaN           NaN           NaN
c       tina       ali  36.0           NaN           NaN
d       jake    milner  24.0         100.0          62.0
e        amy    coozer  73.0           4.0          72.0

In [50]:
df.loc [df['age'] >= 40]

  first_name last_name   age  pretestscore  postestscore
a      jason    miller  42.0           4.0          25.0
e        amy    coozer  73.0           4.0          72.0

In [ ]:
# last_name이 'ali'인 사람의 데이터를 출력하시오

In [53]:
df.loc[df["last_name"]== 'ali']

  first_name last_name   age  pretestscore  postestscore
c       tina       ali  36.0           NaN           NaN

In [ ]:
# 나이가 40이상인 사람의 postestscore 평균점수는 얼마인가?

In [62]:
df.loc [df['age'] > 40]['postestscore'].mean()

48.5

In [59]:
df['age'] > 40

a     True
b    False
c    False
d    False
e     True
Name: age, dtype: bool

In [ ]:
# 새로운 칼럼 추가

In [63]:
df['address'] = ['seoul','Incheon','daejeon','pusan','gwangju']
df

  first_name last_name   age  pretestscore  postestscore  address
a      jason    miller  42.0           4.0          25.0    seoul
b        NaN       NaN   NaN           NaN           NaN  Incheon
c       tina       ali  36.0           NaN           NaN  daejeon
d       jake    milner  24.0         100.0          62.0    pusan
e        amy    coozer  73.0           4.0          72.0  gwangju

In [65]:
 # df.columns = ['fn','In','age','pres','posts','add']
df.rename(columns = {'add':'address'}, inplace=True)
df

      fn      In   age   pres  posts  address
a  jason  miller  42.0    4.0   25.0    seoul
b    NaN     NaN   NaN    NaN    NaN  Incheon
c   tina     ali  36.0    NaN    NaN  daejeon
d   jake  milner  24.0  100.0   62.0    pusan
e    amy  coozer  73.0    4.0   72.0  gwangju

In [ ]:
# column 또는 row를 삭제하는 명령

In [66]:
df.drop("address", axis=1)

      fn      In   age   pres  posts
a  jason  miller  42.0    4.0   25.0
b    NaN     NaN   NaN    NaN    NaN
c   tina     ali  36.0    NaN    NaN
d   jake  milner  24.0  100.0   62.0
e    amy  coozer  73.0    4.0   72.0

In [67]:
df                   # 원본 반영 안됨

      fn      In   age   pres  posts  address
a  jason  miller  42.0    4.0   25.0    seoul
b    NaN     NaN   NaN    NaN    NaN  Incheon
c   tina     ali  36.0    NaN    NaN  daejeon
d   jake  milner  24.0  100.0   62.0    pusan
e    amy  coozer  73.0    4.0   72.0  gwangju

In [68]:
df.drop("address", axis=1, inplace = True)      # <---- 원본 반영됨

In [69]:
df

      fn      In   age   pres  posts
a  jason  miller  42.0    4.0   25.0
b    NaN     NaN   NaN    NaN    NaN
c   tina     ali  36.0    NaN    NaN
d   jake  milner  24.0  100.0   62.0
e    amy  coozer  73.0    4.0   72.0

In [70]:
df.drop("c",axis=0)

      fn      In   age   pres  posts
a  jason  miller  42.0    4.0   25.0
b    NaN     NaN   NaN    NaN    NaN
d   jake  milner  24.0  100.0   62.0
e    amy  coozer  73.0    4.0   72.0

In [74]:
df.drop(['In','pres'], axis=1)

      fn   age  posts
a  jason  42.0   25.0
b    NaN   NaN    NaN
c   tina  36.0    NaN
d   jake  24.0   62.0
e    amy  73.0   72.0